wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_qspi.c
    /* call the configuration function */
    qspi_config(cmd, QSPI_NORMAL_WRITE);

    if(cmd->data_mode == QSPI_DATA_NONE) {
        /* when there is no data phase, the transfer start as soon as the configuration is done
        so wait until TC flag is set to go back in idle state */
        while(((QSPI_STAT & QSPI_FLAG_TC ) == 0U) && (timeout > 0U)){
            timeout--;
        }
        QSPI_STATC = QSPI_STATC_TCC;
    }
}

/*!
    \brief      configure QSPI read polling mode
    \param[in]  cmd: QSPI command parameter structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  cfg: QSPI read polling parameter structure
                             and the member values are shown as below:
                  match: between 0 and 0xFFFFFFFF
                  mask: between 0 and 0xFFFFFFFF
                  interval: between 0 and 0xFFFF
                  statusbytes_size: between 1 and 4
                  match_mode: QSPI_MATCH_MODE_AND, QSPI_MATCH_MODE_OR
                  polling_stop: QSPI_POLLING_STOP_DISABLE,QSPI_POLLING_STOP_ENABLE
    \param[out] none
    \retval     none
*/
void qspi_polling_config(qspi_command_struct *cmd, qspi_polling_struct *cfg)
{
    /* configure the match value */
    QSPI_STATMATCH = cfg->match;
    /* configure the mask value */
    QSPI_STATMK = cfg->mask;
    /* configure the interval cycle */
    QSPI_INTERVAL = cfg->interval;
    /* configure the read polling match mode and read polling mode stop */
    QSPI_CTL &= ~(QSPI_CTL_RPMS | QSPI_CTL_RPMM);
    QSPI_CTL |= (cfg->match_mode | cfg->polling_stop);

    cmd->data_length = cfg->statusbytes_size;
    qspi_config(cmd, QSPI_READ_POLLING);
}

/*!
    \brief      configure QSPI memory mapped mode
    \param[in]  cmd: QSPI command parameter structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  timeout: 0-0xFFFF
    \param[in]  toen:
      \arg        QSPI_TMOUT_DISABLE: disable timeout counter
      \arg        QSPI_TMOUT_ENABLE: enable timeout counter
    \param[out] none
    \retval     none
*/
void qspi_memorymapped_config(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen)
{
    /* enable timeout */
    QSPI_CTL &= ~QSPI_CTL_TMOUTEN;
    QSPI_CTL |= toen;

    if(toen == QSPI_CTL_TMOUTEN) {
        /* configure the timeout value */
        QSPI_TMOUT = timeout;
        QSPI_STATC = QSPI_STATC_TMOUTC;
        /* enable the QSPI timeout interrupt */
        QSPI_CTL |= QSPI_CTL_TMOUTIE;
    }
    qspi_config(cmd, QSPI_MEMORY_MAPPED);
}

/*!
    \brief      QSPI transmit data function
    \param[in]  tdata: pointer to the data to be transmitted
    \param[out] none
    \retval     none
*/
void qspi_data_transmit(uint8_t tdata[])
{
    uint32_t tx_cnt;
    uint32_t index = 0U;
    uint16_t timeout = QSPI_DATA_TRANSMIT_TOMEOUT;
    
    tx_cnt = QSPI_DTLEN + 1U;

    QSPI_TCFG = (QSPI_TCFG & ~QSPI_TCFG_FMOD) | QSPI_NORMAL_WRITE;

    while(tx_cnt > 0U) {
        while(((QSPI_STAT & QSPI_FLAG_FT ) == 0U) && (timeout > 0U)){
            timeout--;
        }
        /* transmit data */
        *(uint8_t *)(QSPI + 0x00000020U) = tdata[index++];
        tx_cnt--;
    }
}

/*!
    \brief      QSPI receive data function
    \param[in]  none
    \param[out] rdata: pointer to the data to be received
    \retval     none
*/
void qspi_data_receive(uint8_t rdata[])
{
    uint32_t rx_cnt, addr;
    uint32_t index = 0U;
    uint16_t timeout = QSPI_DATA_RECEIVE_TOMEOUT;
    
    rx_cnt = QSPI_DTLEN + 1U;
    addr = QSPI_ADDR;

    QSPI_TCFG = (QSPI_TCFG & ~QSPI_TCFG_FMOD) | QSPI_NORMAL_READ;
    /* start the transfer by re-writing the address in QSPI_ADDR register */
    QSPI_ADDR = addr;

    while(rx_cnt > 0U) {
        while(((QSPI_STAT & (QSPI_FLAG_FT | QSPI_FLAG_TC)) == 0U) && (timeout > 0U)){
            timeout--;
        }
        rdata[index++] = *(uint8_t *)(QSPI + 0x00000020U);
        rx_cnt--;
    }
}

/*!
    \brief      abort the current transmission
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_transmission_abort(void)
{
    QSPI_CTL |= (uint32_t)(QSPI_CTL_ABORT);
}

/*!
    \brief      enable QSPI output clock delay
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_enable(void)
{
    QSPI_CTL |= (uint32_t)QSPI_CTL_OCKDEN;
}

/*!
    \brief      disable QSPI output clock delay
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_OCKDEN);
}

/*!
    \brief      configure output clock delay
    \param[in]  ck_delay: 0~15
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_config(uint32_t ck_delay)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_OCKDV);
    QSPI_CTL |= (uint32_t)(ck_delay << CTL_OUTPUT_CK_DELAY_OFFSET);
}

/*!
    \brief      configure QSPI sample shift
    \param[in]  sample_shift1: QSPI sample shift1, support use with 2
                only one parameter can be selected which are shown as below:
      \arg        QSPI_SAMPLE_SHIFTING_NONE: no shift when sample data
      \arg        QSPI_SAMPLE_SHIFTING_HALFCYCLE: 1/2 sck cycle shift
    \param[in]  sample_shift2: QSPI sample shift2, support use with 1
                only one parameter can be selected which are shown as below:
      \arg        QSPI_SHIFTING_NONE: no shift when sample data
      \arg        QSPI_SHIFTING_1_CYCLE: 1 sck cycle shift
      \arg        QSPI_SHIFTING_2_CYCLE: 2 sck cycle shift
      \arg        QSPI_SHIFTING_3_CYCLE: 3 sck cycle shift
      \arg        QSPI_SHIFTING_4_CYCLE: 4 sck cycle shift
      \arg        QSPI_SHIFTING_5_CYCLE: 5 sck cycle shift
      \arg        QSPI_SHIFTING_6_CYCLE: 6 sck cycle shift
      \arg        QSPI_SHIFTING_7_CYCLE: 7 sck cycle shift
    \param[out] none
    \retval     none
*/
void qspi_sample_shift_config(uint32_t sample_shift1, uint32_t sample_shift2)
{
    if(QSPI_SAMPLE_SHIFTING_NONE == sample_shift1) {
        QSPI_CTL &= (uint32_t)(~QSPI_CTL_SSAMPLE);
    } else {
        QSPI_CTL |= sample_shift1;
    }

