wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_qspi.c
    if(QSPI_SHIFTING_NONE == sample_shift2) {
        QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_RXSFT);
    } else {
        QSPI_DCFG |= sample_shift2;
    }
}

/*!
    \brief      select receive clock
    \param[in]  rcksel: receive clock select
                only one parameter can be selected which are shown as below:
      \arg        QSPI_RECEIVE_CLOCK_SCK: select SCK as receive clock
      \arg        QSPI_RECEIVE_CLOCK_DQS: select DQS as receive clock
    \param[out] none
    \retval     none
*/
void qspi_receive_clock_sel(uint32_t rcksel)
{
    if(QSPI_RECEIVE_CLOCK_SCK == rcksel) {
        QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_RCKSEL);
    } else {
        QSPI_DCFG |= rcksel;
    }
}

/*!
    \brief      enable QSPI delay scan
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_delay_scan_enable(void)
{
    QSPI_DCFG |= (uint32_t)QSPI_DCFG_DLYSCEN;
}

/*!
    \brief      disable QSPI delay scan
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_delay_scan_disable(void)
{
    QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_DLYSCEN);
}

/*!
    \brief      csn falls and rises 1 or 2 sck cycles select
    \param[in]  csn_cycle: receive clock select
                only one parameter can be selected which are shown as below:
      \arg        QSPI_CSN_1_CYCLE: csn falls and rises 1 sck cycle
      \arg        QSPI_CSN_2_CYCLE: csn falls and rises 2 sck cycle
    \param[out] none
    \retval     none
*/
void qspi_csn_edge_cycle(uint32_t csn_cycle)
{
    if(QSPI_CSN_1_CYCLE == csn_cycle) {
        QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_CSNCKM);
    } else {
        QSPI_DCFG |= csn_cycle;
    }
}

/*!
    \brief      get QSPI flag status
    \param[in]  flag: QSPI flag
                only one parameter can be selected which are shown as below:
      \arg        QSPI_FLAG_BUSY: busy flag
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_FT: FIFO threshold flag
      \arg        QSPI_FLAG_RPMF: read polling match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus qspi_flag_get(uint32_t flag)
{
    FlagStatus flag_status;
    
    if(RESET != (QSPI_STAT & flag)) {
        flag_status = SET;
    } else {
        flag_status = RESET;
    }
    return flag_status;
}

/*!
    \brief      clear QSPI flag status
    \param[in]  flag: QSPI flag
                one or more parameters can be selected which are shown as below:
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_RPMF: read polling match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     none
*/
void qspi_flag_clear(uint32_t flag)
{
    QSPI_STATC |= (uint32_t)flag;
}

/*!
    \brief      enable QSPI interrupt
    \param[in]  interrupt: QSPI interrupt
                one or more parameters can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_RPMF: read polling match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_enable(uint32_t interrupt)
{
    QSPI_CTL |= (uint32_t)interrupt;
}

/*!
    \brief      disable QSPI interrupt
    \param[in]  interrupt: QSPI interrupt
                one or more parameters can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_RPMF: read polling match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_disable(uint32_t interrupt)
{
    QSPI_CTL &= ~(uint32_t)interrupt;
}

/*!
    \brief      get QSPI interrupt flag status
    \param[in]  int_flag: QSPI interrupt flag
                only one parameter can be selected which are shown as below:
      \arg        QSPI_INT_FLAG_TERR: transfer error interrupt flag
      \arg        QSPI_INT_FLAG_TC: transfer complete interrupt flag
      \arg        QSPI_INT_FLAG_FT: FIFO threshold interrupt flag
      \arg        QSPI_INT_FLAG_RPMF: read polling match interrupt flag
      \arg        QSPI_INT_FLAG_TMOUT: timeout interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus qspi_interrupt_flag_get(uint32_t int_flag)
{
    uint32_t reg1 = QSPI_CTL;
    uint32_t reg2 = QSPI_STAT;
    FlagStatus flag_status;

    switch(int_flag) {
    /* QSPI transfer error interrupt flag */
    case QSPI_INT_FLAG_TERR:
        reg1 = reg1 & QSPI_STAT_TERR;
        reg2 = reg2 & QSPI_CTL_TERRIE;
        break;
    /* QSPI transfer complete interrupt flag */
    case QSPI_INT_FLAG_TC:
        reg1 = reg1 & QSPI_STAT_TC;
        reg2 = reg2 & QSPI_CTL_TCIE;
        break;
    /* QSPI FIFO threshold interrupt flag */
    case QSPI_INT_FLAG_FT:
        reg1 = reg1 & QSPI_STAT_FT;
        reg2 = reg2 & QSPI_CTL_FTIE;
        break;
    /* QSPI status match interrupt flag */
    case QSPI_INT_FLAG_RPMF:
        reg1 = reg1 & QSPI_STAT_RPMF;
        reg2 = reg2 & QSPI_CTL_RPMFIE;
        break;
    /* QSPI timeout interrupt flag */
    case QSPI_INT_FLAG_TMOUT:
        reg1 = reg1 & QSPI_STAT_TMOUT;
        reg2 = reg2 & QSPI_CTL_TMOUTIE;
        break;
    default :
        break;
    }
    /* get QSPI interrupt flag status */
    if(reg1 && reg2) {
        flag_status = SET;
    } else {
        flag_status = RESET;
    }
    
    return flag_status;
}

/*!
    \brief      clear QSPI interrupt flag status
    \param[in]  int_flag: QSPI interrupt flag
                one or more parameters can be selected which are shown as below:
      \arg        QSPI_INT_FLAG_TERR: transfer error interrupt flag
      \arg        QSPI_INT_FLAG_TC: transfer complete interrupt flag
      \arg        QSPI_INT_FLAG_RPMF: read polling match interrupt flag
      \arg        QSPI_INT_FLAG_TMOUT: timeout interrupt flag
    \param[out] none
    \retval     none
*/
void qspi_interrupt_flag_clear(uint32_t int_flag)
{
    QSPI_STATC |= (uint32_t)int_flag;
}

/*!
    \brief      configure QSPI functional mode
    \param[in]  cmd: QSPI command parameter structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  functionalmode: QSPI functional mode select
                only one parameter can be selected which is shown as below:
      \arg        QSPI_NORMAL_WRITE
      \arg        QSPI_NORMAL_READ
      \arg        QSPI_READ_POLLING
      \arg        QSPI_MEMORY_MAPPED
    \param[out] none
    \retval     none
*/
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode)
{
    if((cmd->data_mode != QSPI_DATA_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)) {
        /* configure QSPI_DTLEN register with the number of data to read or write */
        QSPI_DTLEN = cmd->data_length - 1U;
    }

    if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE) {
        /* configure QSPI_ALTE register with alternate bytes value */
        QSPI_ALTE = cmd->altebytes;
    }

    if((cmd->data_mode != QSPI_DATA_NONE) || (cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE) || \
            (cmd->addr_mode != QSPI_ADDR_NONE) || (cmd->instruction_mode != QSPI_INSTRUCTION_NONE)) {
        QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << TCFG_DUMYC_OFFSET) | cmd->sioo_mode |
                    cmd->altebytes_size | cmd->altebytes_mode |
                    cmd->addr_size | cmd->addr_mode | cmd->instruction_mode |
                    cmd->instruction | cmd->trans_rate | cmd->trans_delay | functionalmode;
    }

    if((cmd->addr_mode != QSPI_ADDR_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)) {
        /* configure QSPI_ADDR register with address value */
        QSPI_ADDR = cmd->addr;
    }
}
